package march7.uslovnyeOperatoryCycleArrays;

public class Task3 {
    /*
 3) Напишите программу, которая получает три числа и выводит количество одинаковых чисел в 		этой цепочке.
	Пример:
		 5 5 5 -> 3
		 5 7 5 -> 2
 		 5 7 9 -> одинаковых чисел нет
     */
    public static void main(String[] args) {
        System.out.println("Task 3");
//not done
    }
}
